artillery-test.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 60
      arrivalRate: 10

scenarios:
  - name: 'Prediction load test'
    requests:
      - post:
          url: '/predict'
          headers:
            Content-Type: 'application/json'
          json:
            race: 'Caucasian'
            gender: 'Female'
            age: '[60-70)'
            time_in_hospital: 7
            num_medications: 15
            number_outpatient: 0
            number_emergency: 1
            number_inpatient: 0
            number_diagnoses: 9
            a1c_result: '>7'
            max_glu_serum: 'None'
            change: 'Ch'
            diabetesMed: 'Yes'

#artillery run artillery-test.yml